```markdown
# Лабораторная работа: Базовая настройка коммутатора

## Топология

## Таблица адресации

| Устройство | Интерфейс | IP-адрес / Префикс |
|------------|-----------|---------------------|
| S1         | VLAN 1    | 192.168.1.2 /24     |
| S1         | VLAN 99   |                     |
| PC-A       | NIC       | 192.168.1.10 /24    |

## Задачи

- Часть 1: Проверка конфигурации коммутатора по умолчанию
- Часть 2: Создание сети и настройка основных параметров устройства
- Часть 3: Проверка сетевых подключений

## Общие сведения/сценарий

На коммутаторах Cisco можно настроить особый IP-адрес, который называют виртуальным интерфейсом коммутатора (SVI). SVI или адрес управления можно использовать для удаленного доступа к коммутатору в целях отображения или настройки параметров. Если для SVI сети VLAN 1 назначен IP-адрес, то по умолчанию все порты в сети VLAN 1 имеют доступ к IP-адресу управления SVI.

В ходе данной лабораторной работы вам предстоит построить простую топологию, используя Ethernet-кабель локальной сети, и получить доступ к коммутатору Cisco, используя консольное подключение и методы удаленного доступа. Перед настройкой базовых параметров коммутатора нужно проверить настройки коммутатора по умолчанию.

Примечание. В лабораторной работе используются коммутаторы Cisco Catalyst 2960s с операционной системой Cisco IOS 15.2(2) (образ lanbasek9). Допускается использование других моделей коммутаторов и других версий Cisco IOS. В зависимости от модели устройства и версии Cisco IOS доступные команды и результаты их выполнения могут отличаться от тех, которые показаны в лабораторных работах.

---

## Часть 1. Проверка конфигурации коммутатора по умолчанию

1. Подключите консольный кабель к коммутатору и компьютеру. 
2. Установите консольное подключение к коммутатору с компьютера PC-A с помощью программы эмуляции терминала (например, Tera Term).
   
    **Вопрос: Почему нужно использовать консольное подключение для первоначальной настройки коммутатора? Почему нельзя подключиться к коммутатору через Telnet или SSH?**
    - **Ответ** Консольное подключение используется для первоначальной настройки коммутатора по нескольким причинам:

**Отсутствие настроек сети:** На новом коммутаторе обычно нет настроенных IP-адресов или маршрутов, что делает невозможным подключение к нему через Telnet или SSH, которые требуют действующей сетевой конфигурации. Консольный порт работает независимо от сетевых настроек.

**Безопасность:** Подключение через консольный порт более безопасно, поскольку оно требует физического доступа к устройству. Telnet и SSH подразумевают сетевое подключение, которое может быть подвержено различным атакам.

**Устойчивость к проблемам с сетью:** Если возникают проблемы с сетью (например, неправильные настройки VLAN или маршрутизации), консольное подключение позволяет администратору получить доступ к коммутатору и устранить эти проблемы, не полагаясь на доступ через сеть.

**Первоначальная настройка:** При первой настройке коммутатора администраторы часто используют консоль для конфигурации базовых параметров, таких как управление пользователями, IP-адресация, настройки безопасности и другие важные параметры.

Консольное подключение обеспечивает надежный и безопасный способ конфигурации устройства до того, как оно будет подключено к сети.
    
3. Проверьте настройки коммутатора по умолчанию:
    ```bash
    Switch> enable
    Switch# show running-config
    ```
   
    Если конфигурационный файл был сохранен ранее, его нужно удалить:
    ```bash
    Switch# erase startup-config
    Switch# reload
    ```

4. Изучите текущую конфигурацию коммутатора.
    **Вопросы:**
   - Сколько интерфейсов FastEthernet имеется на коммутаторе 2960?  
     **Ответ:** 24
   - Сколько интерфейсов Gigabit Ethernet имеется на коммутаторе 2960?  
     **Ответ:** 2
   - Каков диапазон значений отображаемых в vty-линиях?  
     **Ответ:** 0–15

5. Проверьте файл загрузочной конфигурации:
    ```bash
    S1# show startup-config
    ```
   
    **Вопрос:** Почему появляется сообщение "startup-config is not present"?  
    **Ответ:** Потому что коммутатор не имеет файла конфигурации, сохраненного в энергонезависимой памяти (NVRAM), так как запускается впервые.

6. Изучите характеристики интерфейса VLAN 1:
    ```bash
    S1# show interface vlan1
    ```

    **Вопросы:**
    - Назначен ли IP-адрес сети VLAN 1?  
      **Ответ:** Нет, не назначен.
    - Какой MAC-адрес имеет SVI?  
      **Ответ:** MAC-адрес отсутствует, так как интерфейс выключен.
    - Включен ли интерфейс?  
      **Ответ:** Интерфейс выключен.

7. Подсоедините кабель Ethernet компьютера PC-A к порту 6 на коммутаторе и изучите IP-свойства интерфейса SVI сети VLAN 1.

---

## Часть 2. Настройка базовых параметров сетевых устройств

1. Настройка базовых параметров коммутатора:
    ```bash
    S1(config)# no ip domain-lookup
    S1(config)# hostname S1
    S1(config)# service password-encryption
    S1(config)# enable secret class
    S1(config)# banner motd # Unauthorized access is strictly prohibited. #
    ```

2. Назначьте IP-адрес интерфейсу SVI:
    ```bash
    S1(config)# interface vlan1
    S1(config-if)# ip address 192.168.1.2 255.255.255.0
    S1(config-if)# no shutdown
    ```

3. Настройка консольного пароля:
    ```bash
    S1(config)# line con 0
    S1(config-line)# password cisco
    S1(config-line)# logging synchronous
    S1(config-line)# login
    ```

4. Настройка VTY-линий для удаленного доступа (Telnet):
    ```bash
    S1(config)# line vty 0 4
    S1(config-line)# password cisco
    S1(config-line)# login
    S1(config-line)# transport input telnet
    ```

    **Вопрос:** Для чего нужна команда `login`?  
    **Ответ:** Для активации установленного пароля. Команда обеспечивает запрос логина и пароля при подключении к устройству.

---

## Часть 3. Проверка сетевых подключений

1. Настройте IP-адрес на компьютере PC-A:
    - Перейдите в "Панель управления" → "Просмотр состояния сети и задач" → "Изменение параметров адаптера".
    - Назначьте IP-адрес и маску подсети в соответствии с таблицей адресации:
      - IP-адрес: 192.168.1.10
      - Маска подсети: 255.255.255.0

2. Проверьте текущую конфигурацию коммутатора:
    ```bash
    S1# show run
    ```

    Пример вывода конфигурации:
    ```bash
    hostname S1
    enable secret 5 $1$mtvC$6NC.1VKr3p6bj7YGE.jNg0
    ip address 192.168.1.2 255.255.255.0
    banner motd ^C Unauthorized access is strictly prohibited. ^C
    ```

3. Проверьте параметры VLAN 1:
    ```bash
    S1# show interface vlan1
    ```

    **Вопрос:** Какова полоса пропускания этого интерфейса?  
    **Ответ:** BW 100000 Kbit

4. Протестируйте сквозное соединение с помощью утилиты `ping`:
    ```bash
    PC-A> ping 192.168.1.2
    ```

5. Проверьте удалённое управление с помощью Telnet:
    - Используйте программу Tera Term для подключения по Telnet к S1:
    ```bash
    telnet 192.168.1.2
    ```
    - Введите пароль "cisco", чтобы получить доступ к командной строке коммутатора.

    Для завершения сеанса введите:
    ```bash
    exit
    ```

---

## Вопросы для повторения

1. **Зачем нужен пароль VTY?** Для ограничения доступа к устройству через удаленные соединения.
2. **Как настроить шифрование паролей?** Используя команду `service password-encryption`.

---
## Приложение А. Инициализация и перезагрузка коммутатора

1. Подключитесь к коммутатору с помощью консоли и войдите в привилегированный режим EXEC:
    ```bash
    Switch> enable
    Switch# show flash
    ```

2. Удалите файл `vlan.dat`, если он существует:
    ```bash
    Switch# delete vlan.dat
    ```

3. Удалите файл загрузочной конфигурации:
    ```bash
    Switch# erase startup-config
    ```

4. Перезагрузите коммутатор:
    ```bash
    Switch# reload
    ```

---