# Лабораторная работа: Базовая настройка коммутатора

## Топология

![image](https://github.com/user-attachments/assets/8fd9b29d-5dee-44b7-aa1f-8fa685167973)

### Таблица адресации

| Устройство | Интерфейс | IP-адрес / Префикс |
|------------|-----------|---------------------|
| S1         | VLAN 1    | 192.168.1.2 /24     |
| S1         | VLAN 99   |                     |
| PC-A       | NIC       | 192.168.1.10 /24    |

### Задачи

- Часть 1: Проверка конфигурации коммутатора по умолчанию
- Часть 2: Создание сети и настройка основных параметров устройства
- Часть 3: Проверка сетевых подключений

## Общие сведения/сценарий

На коммутаторах Cisco можно настроить особый IP-адрес, который называют виртуальным интерфейсом коммутатора (SVI). SVI или адрес управления можно использовать для удаленного доступа к коммутатору в целях отображения или настройки параметров. Если для SVI сети VLAN 1 назначен IP-адрес, то по умолчанию все порты в сети VLAN 1 имеют доступ к IP-адресу управления SVI.

В ходе данной лабораторной работы вам предстоит построить простую топологию, используя Ethernet-кабель локальной сети, и получить доступ к коммутатору Cisco, используя консольное подключение и методы удаленного доступа. Перед настройкой базовых параметров коммутатора нужно проверить настройки коммутатора по умолчанию.

Примечание. В лабораторной работе используются коммутаторы Cisco Catalyst 2960s с операционной системой Cisco IOS 15.2(2) (образ lanbasek9). Допускается использование других моделей коммутаторов и других версий Cisco IOS. В зависимости от модели устройства и версии Cisco IOS доступные команды и результаты их выполнения могут отличаться от тех, которые показаны в лабораторных работах.

---

## Часть 1. Проверка конфигурации коммутатора по умолчанию

1. Подключите консольный кабель к коммутатору и компьютеру. 
2. Установите консольное подключение к коммутатору с компьютера PC-A с помощью программы эмуляции терминала (например, Tera Term).
   
    **Вопрос: Почему нужно использовать консольное подключение для первоначальной настройки коммутатора? Почему нельзя подключиться к коммутатору через Telnet или SSH?**
    - **Ответ** Консольное подключение используется для первоначальной настройки коммутатора по нескольким причинам:

**Отсутствие настроек сети:** На новом коммутаторе обычно нет настроенных IP-адресов или маршрутов, что делает невозможным подключение к нему через Telnet или SSH, которые требуют действующей сетевой конфигурации. Консольный порт работает независимо от сетевых настроек.

**Безопасность:** Подключение через консольный порт более безопасно, поскольку оно требует физического доступа к устройству. Telnet и SSH подразумевают сетевое подключение, которое может быть подвержено различным атакам.

**Устойчивость к проблемам с сетью:** Если возникают проблемы с сетью (например, неправильные настройки VLAN или маршрутизации), консольное подключение позволяет администратору получить доступ к коммутатору и устранить эти проблемы, не полагаясь на доступ через сеть.

**Первоначальная настройка:** При первой настройке коммутатора администраторы часто используют консоль для конфигурации базовых параметров, таких как управление пользователями, IP-адресация, настройки безопасности и другие важные параметры.

Консольное подключение обеспечивает надежный и безопасный способ конфигурации устройства до того, как оно будет подключено к сети.
    
3. Проверьте настройки коммутатора по умолчанию:
    ```bash
    Switch> enable
    Switch# show running-config
    ```
   
    Если конфигурационный файл был сохранен ранее, его нужно удалить:
    ```bash
    Switch# erase startup-config
    Switch# reload
    ```

4. Изучите текущую конфигурацию коммутатора.
    **Вопросы:**
   - Сколько интерфейсов FastEthernet имеется на коммутаторе 2960?  
     **Ответ:** 24
   - Сколько интерфейсов Gigabit Ethernet имеется на коммутаторе 2960?  
     **Ответ:** 2
   - Каков диапазон значений отображаемых в vty-линиях?  
     **Ответ:** 0–15

5. Проверьте файл загрузочной конфигурации:
    ```bash
    S1# show startup-config
    ```
   
    **Вопрос:** Почему появляется сообщение "startup-config is not present"?  
    **Ответ:** Потому что коммутатор не имеет файла конфигурации, сохраненного в энергонезависимой памяти (NVRAM), так как запускается впервые.

6. Изучите характеристики интерфейса VLAN 1:
    ```bash
    S1# show interface vlan1
    ```
   ![image](https://github.com/user-attachments/assets/2d72cab9-0cab-45ca-a340-d432d09b5831)

   **Вопросы:**
    - Назначен ли IP-адрес сети VLAN 1?  
   **Ответ:** Нет, не назначен.
   
   ![image](https://github.com/user-attachments/assets/f315b508-9dd1-4c95-92d9-25170bf481a4)

    - Какой MAC-адрес имеет SVI?  
   **Ответ:** MAC-адрес отсутствует, так как интерфейс выключен.
    - Включен ли интерфейс?  
   **Ответ:** Интерфейс выключен.
![image](https://github.com/user-attachments/assets/e66490a5-0ce5-4e8d-ac41-523d920e88aa)

7. Подсоедините кабель Ethernet компьютера PC-A к порту 6 на коммутаторе и изучите IP-свойства интерфейса SVI сети VLAN 1.

---
8.	Изучите сведения о версии ОС Cisco IOS на коммутаторе.
**Вопросы:**
Под управлением какой версии ОС Cisco IOS работает коммутатор?
Как называется файл образа системы?
![image](https://github.com/user-attachments/assets/03920266-f982-44d8-8597-8d00da63395d)
9.	Изучите свойства по умолчанию интерфейса FastEthernet, который используется компьютером PC-A.
```bash
S1# show interface f0/6
```
**Вопрос:**
Интерфейс включен или выключен?
**Ответ:**
Интерфейс находится во включенном состоянии
![image](https://github.com/user-attachments/assets/02b6748c-f2ee-4787-ab49-a80fb833d660)
**Вопрос:**
Что нужно сделать, чтобы включить интерфейс? 
**Ответ:**
Подключить консольный кабель на устройстве (на компьютере или на коммутаторе). Проверить состояние интерфейса через команду show interface f0/6 из привилегированного режима
**Какой MAC-адрес у интерфейса?**
address is 0009.7c73.b306
**Какие настройки скорости и дуплекса заданы в интерфейсе?**
Full-duplex, 100Mb/s
10.	Изучите флеш-память.
Выполните одну из следующих команд, чтобы изучить содержимое флеш-каталога.
```bash
S1# show flash 
S1# dir flash:
```
![image](https://github.com/user-attachments/assets/bfbeb2ea-a271-4642-83c0-ae5ad8baf1b7)

В конце имени файла указано расширение, например .bin. Каталоги не имеют расширения файла.
**Вопрос:**
Какое имя присвоено образу Cisco IOS?
![image](https://github.com/user-attachments/assets/7e741870-7096-4ea4-a736-eadb10897813)


## Часть 2. Настройка базовых параметров сетевых устройств

1. Настройка базовых параметров коммутатора:
    ```bash
    S1(config)# no ip domain-lookup
    S1(config)# hostname S1
    S1(config)# service password-encryption
    S1(config)# enable secret class
    S1(config)# banner motd # Unauthorized access is strictly prohibited. #
    ```

2. Назначьте IP-адрес интерфейсу SVI:
    ```bash
    S1(config)# interface vlan1
    S1(config-if)# ip address 192.168.1.2 255.255.255.0
    S1(config-if)# no shutdown
    ```

3. Настройка консольного пароля:
    ```bash
    S1(config)# line con 0
    S1(config-line)# password cisco
    S1(config-line)# logging synchronous
    S1(config-line)# login
    ```

4. Настройка VTY-линий для удаленного доступа (Telnet):
    ```bash
    S1(config)# line vty 0 4
    S1(config-line)# password cisco
    S1(config-line)# login
    S1(config-line)# transport input telnet
    ```

    **Вопрос:** Для чего нужна команда `login`?  
    **Ответ:** Для активации установленного пароля. Команда обеспечивает запрос логина и пароля при подключении к устройству.

---

## Часть 3. Проверка сетевых подключений

1. Настройте IP-адрес на компьютере PC-A:
    - Перейдите в "Панель управления" → "Просмотр состояния сети и задач" → "Изменение параметров адаптера".
    - Назначьте IP-адрес и маску подсети в соответствии с таблицей адресации:
      - IP-адрес: 192.168.1.10
      - Маска подсети: 255.255.255.0

2. Проверьте текущую конфигурацию коммутатора:
    ```bash
    S1# show run
    ```
    ![image](https://github.com/user-attachments/assets/8f19f9c3-4829-4f53-96a5-d6bd323e4d93)

    Пример вывода конфигурации:
    ```bash
    hostname S1
    enable secret 5 $1$mtvC$6NC.1VKr3p6bj7YGE.jNg0
    ip address 192.168.1.2 255.255.255.0
    banner motd ^C Unauthorized access is strictly prohibited. ^C
    ```

3. Проверьте параметры VLAN 1:
    ```bash
    S1# show interface vlan1
    ```
    ![image](https://github.com/user-attachments/assets/f1e21558-b25f-4f9b-abbc-3cd50878a575)

    **Вопрос:** Какова полоса пропускания этого интерфейса?  
    **Ответ:** BW 100000 Kbit

4. Протестируйте сквозное соединение с помощью утилиты `ping`:
    ```bash
    PC-A> ping 192.168.1.2
    ```
    ![image](https://github.com/user-attachments/assets/b7aa0415-96c2-47f9-a622-24cdd056fe5d)

5. Проверьте удалённое управление с помощью Telnet:
    - Используйте программу Tera Term для подключения по Telnet к S1:
    ```bash
    telnet 192.168.1.2
    ```
    
    - Введите пароль "cisco", чтобы получить доступ к командной строке коммутатора.

    Для завершения сеанса введите:
    ```bash
    exit
    ```

---

## Вопросы для повторения

1. **Зачем нужен пароль VTY?** Для ограничения доступа к устройству через удаленные соединения.
2. **Как настроить шифрование паролей?** Используя команду `service password-encryption`.

---
## Приложение А. Инициализация и перезагрузка коммутатора

1. Подключитесь к коммутатору с помощью консоли и войдите в привилегированный режим EXEC:
    ```bash
    Switch> enable
    Switch# show flash
    ```

2. Удалите файл `vlan.dat`, если он существует:
    ```bash
    Switch# delete vlan.dat
    ```

3. Удалите файл загрузочной конфигурации:
    ```bash
    Switch# erase startup-config
    ```

4. Перезагрузите коммутатор:
    ```bash
    Switch# reload
    ```

---
